onboarding_issue_script.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-03-14 Mon 16:29 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Onboarding Issue Script</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Garrett Robinson" />
</head>
<body>
<div id="content">
<h1 class="title">Onboarding Issue Script</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline2">1. New user should be able to reply to an existing issue</a>
<ul>
<li><a href="#orgheadline1">1.1. New user should be able to receive email notifications</a></li>
</ul>
</li>
<li><a href="#orgheadline3">2. New user should be able to create a new issue</a></li>
<li><a href="#orgheadline7">3. New user should be able to set up the encrypted email workflow (optional)</a>
<ul>
<li><a href="#orgheadline4">3.1. New user should be able to read encrypted email notifications</a></li>
<li><a href="#orgheadline5">3.2. New user should be able to update an issue by replying to an email notification</a></li>
<li><a href="#orgheadline6">3.3. New user should be able to create a new issue by sending an email</a></li>
</ul>
</li>
<li><a href="#orgheadline8">4. Done!</a></li>
</ul>
</div>
</div>
<p>
This is the script for onboarding new users onto the SecureDrop Support Redmine
site. Onboarding users consists of:
</p>

<ol class="org-ol">
<li>Creating an issue on the new user's project for them to interact with</li>
<li>Replying to the issue to get users to do additional tasks in order to help
them practice and ensure they know how to correctly use the new system.</li>
</ol>

<p>
<i>Note for non-Emacs users:</i> This document is written with Org-mode (.org), a
kickass Emacs mode for outlining. It is also plain text, so you can edit it with
your preferred editor. The formatting should be fairly self-explanatory, but in
case it's not, check out the <a href="http://orgmode.org/guide/">Org Guide</a>.
</p>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">1</span> New user should be able to reply to an existing issue</h2>
<div class="outline-text-2" id="text-1">
<p>
Create the initial onboarding issue on the project for the new user's SecureDrop
instance:
</p>

<p>
<b>Subject</b>: Onboarding
<b>Description</b>:
</p>

<div class="org-src-container">

<pre class="src src-markdown"><span style="color: #b3b3b3;">#</span> <span style="color: #ff1493; font-weight: bold;">Welcome to the Freedom of the Press Foundation's SecureDrop Support site!</span>

This is the onboarding issue, which we will use to walk you through the basics of using the support site.

For your first task, write a reply to this issue. Click the <span style="color: #b3b3b3;">**</span><span style="color: #ff69b4; font-weight: bold;">Edit</span><span style="color: #b3b3b3;">**</span> button at either the top or bottom of the issue. Write a reply in the "Notes" text box, then click <span style="color: #b3b3b3;">**</span><span style="color: #ff69b4; font-weight: bold;">Submit</span><span style="color: #b3b3b3;">**</span> at the bottom of the page.

You should see the issue updated with your reply, including a "Successful update" notification in green at the top of the page.

You should also get an email notification of your change to the issue within a few minutes. If you haven't configured encrypted email notifications yet, the message will be "filtered" - that is, you'll get an email notifying you that the issue was changed, but the details of the change will not be included in the body of the email for security reasons.

We'll get a notification of your reply as well, and will reply within a few minutes with the next step of the onboarding process. You should get an email notification when we do. Refresh this page to see our reply.

<span style="color: #b3b3b3;">##</span> <span style="color: #ff1493; font-weight: bold;">Troubleshooting</span>

<span style="color: #b3b3b3;">###</span> <span style="color: #ff1493; font-weight: bold;">I didn't get an email notification</span>

Typically, email notifications are sent within a minute of submitting a change. If you don't get an email notification within 10 minutes of submitting your reply, write another reply on the issue explaining that you're still waiting on the email notification. We'll check the server to make sure it's ok.

You should check your Spam folder to to make sure the notification email wasn't filtered as spam. If it was, check your spam setting or talk to your email provider. Consider whitelisting the support@freedom.press email address.
</pre>
</div>

<p>
The new user should send a reply within a few minutes. Once you've received
their reply, continue to the next step.
</p>
</div>

<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> New user should be able to receive email notifications</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This is an optional step, and only needs to be followed if the user replies
saying they did not receive an email after 10 minutes (following the "I didn't
receive a notification email" steps in the "Troubleshooting" section on the
onboarding issue).
</p>

<p>
Use the issue to communicate back and forth with the user.
</p>

<ul class="org-ul">
<li>Make sure their spam settings are not blocking the emails.</li>
<li>Make sure the server is working and verify that email in question was sent in <code>production.log</code>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">2</span> New user should be able to create a new issue</h2>
<div class="outline-text-2" id="text-2">
<p>
Write a reply on the onboarding issue asking the user to create a new issue.
</p>

<p>
<b>Reply</b>:
</p>

<div class="org-src-container">

<pre class="src src-markdown">For your second task, create a new issue on this project. This is how you will initiate new support requests for your SecureDrop installation.

On the project page, or any of its subpages, navigate to the gray menu bar and click <span style="color: #b3b3b3;">**</span><span style="color: #ff69b4; font-weight: bold;">New issue</span><span style="color: #b3b3b3;">**</span>. Fill out the <span style="color: #b3b3b3;">*</span><span style="color: #ff69b4; font-style: italic;">Subject</span><span style="color: #b3b3b3;">*</span> and <span style="color: #b3b3b3;">*</span><span style="color: #ff69b4; font-style: italic;">Description</span><span style="color: #b3b3b3;">*</span> fields, and leave the rest of the fields set to their defaults. Feel free to explore the rich text editor. You can click the button with a question mark icon for a reference on the markup language (Markdown). When you're done, click <span style="color: #b3b3b3;">**</span><span style="color: #ff69b4; font-weight: bold;">Save</span><span style="color: #b3b3b3;">**</span>.

You should be taken to a page with the new issue, including a "Issue #xyz created" notification at the top of the page. If you go back to the Issues page (by clicking <span style="color: #b3b3b3;">**</span><span style="color: #ff69b4; font-weight: bold;">Issues</span><span style="color: #b3b3b3;">**</span>), you should see both your new issue and the original "Onboarding" issue listed.

You should get an email notification of the new issue within a few minutes. It will have "(New)" in the subject line, as well as the issue's Subject. Note that because OpenPGP does not encrypt subject lines, you should not include potentially sensitive information in the Subject of an issue; however, please try to make them meaningful to avoid driving us crazy :-)

We'll get a notification of the new issue as well, and will reply <span style="color: #b3b3b3;">*</span><span style="color: #ff69b4; font-style: italic;">on the new issue</span><span style="color: #b3b3b3;">*</span> in a few minutes with the next step of the onboarding process.

<span style="color: #b3b3b3;">##</span> <span style="color: #ff1493; font-weight: bold;">Troubleshooting</span>

If you encounter any unexpected problems, let us know in a reply on the original "Onboarding" issue.
</pre>
</div>

<p>
Once the user creates the new issue, write the following reply on the <i>new
issue</i>:
</p>

<p>
<b>Reply</b>:
</p>

<div class="org-src-container">

<pre class="src src-markdown">We got a notification of your new issue, so here's our reply!

Normally, we would be writing an answer to your support request here, or we might ask you for more information to help us understand the problem. Since this was just a learning exercise for onboarding, we're going to close it now.

Go back to the original "Onboarding" issue and look for a reply with the next step in the onboarding process!
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">3</span> New user should be able to set up the encrypted email workflow (optional)</h2>
<div class="outline-text-2" id="text-3">
<p>
Now that the new user is comfortable with creating and replying to issues, they
have everything they need to report issues and interact with us on resolving
them.
</p>

<p>
Ask them if they want to use the encrypted email workflow. This step is
optional, and should only be undertaken if the person is already comfortable
using OpenPGP email. Otherwise, it is probably going to be more trouble than
it's worth and they should stick to the web workflow.
</p>

<p>
On the original "Onboarding" issue, write the following reply:
</p>

<p>
<b>Reply</b>:
</p>

<div class="org-src-container">

<pre class="src src-markdown">Great! Now that you're comfortable creating and replying to issues, you're ready to use Redmine to report issues and request support for your SecureDrop instance.

We optionally provide an encrypted email-based workflow for users who are comfortable using encrypted email. If you would like to use this workflow, write a reply on this issue saying so - we'll walk you through setting it up and testing it to make sure everything's working.

Otherwise, write a reply saying you'd prefer to stick to the web-based workflow and we'll respond with the final part of the onboarding process.
</pre>
</div>

<p>
If they reply in the affirmative, continue with the steps in the subheadings
below. Otherwise, skip to the next section.
</p>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">3.1</span> New user should be able to read encrypted email notifications</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Write a reply on the original "Onboarding" issue:
</p>

<div class="org-src-container">

<pre class="src src-markdown">To get started, follow our <span style="color: #b3b3b3;">[</span><span style="color: #4c83ff;">documentation</span><span style="color: #b3b3b3;">](</span><span style="color: #61CE3C;">https://securedrop-support.readthedocs.org/en/latest/encrypted</span><span style="color: #b3b3b3;">_</span><span style="color: #61CE3C; font-style: italic;">email</span><span style="color: #b3b3b3;">_</span><span style="color: #61CE3C;">overview.html</span><span style="color: #b3b3b3;">)</span> on setting up the encrypted email workflow. We'll wait :-)

Once you have the public keys and your mail client set up, continue by writing a reply on this issue.
</pre>
</div>

<p>
If they have encrypted email set up correctly, then writing a reply on the issue
should trigger an encrypted email notification that they can now read. Verify
that this is the case by writing another reply:
</p>

<div class="org-src-container">

<pre class="src src-markdown">Great! The reply that you just wrote should have triggered an email notification that will get sent to you. Since you've set up the encrypted email workflow, you should get an encrypted email with detailed information about the change you just made to this issue.

Please write a reply confirming that you were able to receive and read an encrypted email notification. If you did not, let us know and we'll work with you to troubleshoot your setup.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">3.2</span> New user should be able to update an issue by replying to an email notification</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Once you've confirmed that they can <i>receive</i> encrypted email notifications, you
should test that they can send encrypted email to update issues as well.
</p>

<p>
Write a reply on the onboarding issue:
</p>

<div class="org-src-container">

<pre class="src src-markdown">Now that you can read the encrypted notification emails sent to you from Redmine, you should also be able to write replies on an issue simply by replying to the email notification.

Try it! Go to the last encrypted email notification for this issue, then hit the <span style="color: #b3b3b3;">**</span><span style="color: #ff69b4; font-weight: bold;">Reply</span><span style="color: #b3b3b3;">**</span> button in your email client. Write your reply in the body of the email (above the line that says "Reply above this line"). Make sure the email is being sent to support@freedom.press, is using PGP/MIME (not inline PGP), and is encrypted and signed. Hit <span style="color: #b3b3b3;">**</span><span style="color: #ff69b4; font-weight: bold;">Send</span><span style="color: #b3b3b3;">**</span>.

After sending the email, wait a minute or two, then refresh this page. You should see the issue updated with a new reply taken from the email you just sent.
</pre>
</div>

<p>
Wait until you see a new reply on the issue that was created by the new user
sending an email. You can tell when a reply was created by email because the
issue will include the line above the "reply above this line" line from the
original email, which usually looks something like: <code>On 3/13/16 1:38 PM, support@freedom.press wrote:</code>.
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">3.3</span> New user should be able to create a new issue by sending an email</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Now that they can reply to issues from email, you should let them know that they
can create issues from email as well.
</p>

<div class="org-src-container">

<pre class="src src-markdown">Now that you can reply to issues from your email inbox, you should know that you can create new issues by email as well!

To do so, simply write a new email to support@freedom.press. The subject line will be used as the Subject of the issue and the body will be used as the Description. Make sure it's PGP/MIME, encrypted and signed, then hit <span style="color: #b3b3b3;">**</span><span style="color: #ff69b4; font-weight: bold;">Send</span><span style="color: #b3b3b3;">**</span>. Our server will automatically create a new issue in the correct project based on your email address.

Note that our server will reject email sent to support@freedom.press if it is not encrypted or validly signed.
</pre>
</div>

<p>
Wait until the user creates a new issue by email. Once they have, reply on the
new issue confirming that we saw it, then close it.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">4</span> Done!</h2>
<div class="outline-text-2" id="text-4">
<p>
Write a reply on the original "Onboarding" issue:
</p>

<div class="org-src-container">

<pre class="src src-markdown">You're done! Thanks for taking the time to set up your account on the new SecureDrop Support server and walk through the onboarding process with us. From now on, please report all support requests to us through this system.

If you have any questions, check out the <span style="color: #b3b3b3;">[</span><span style="color: #4c83ff;">SecureDrop Support Server Documentation</span><span style="color: #b3b3b3;">](</span><span style="color: #61CE3C;">https://securedrop-support.readthedocs.org</span><span style="color: #b3b3b3;">)</span> online. If you still can't find what you're looking for, open a new issue on the Support Server and we'll discuss your question there.

Now that we've finished the onboarding process, we're going to close this "Onboarding" issue. If you'd like to refer back to it at any time, you can find it by showing Closed issues on the Issues page. To do so, go to your project page and click <span style="color: #b3b3b3;">**</span><span style="color: #ff69b4; font-weight: bold;">Issues</span><span style="color: #b3b3b3;">**</span>. In the <span style="color: #b3b3b3;">*</span><span style="color: #ff69b4; font-style: italic;">Filters</span><span style="color: #b3b3b3;">*</span> section, change <span style="color: #b3b3b3;">*</span><span style="color: #ff69b4; font-style: italic;">Status</span><span style="color: #b3b3b3;">*</span> from <span style="color: #b3b3b3;">*</span><span style="color: #ff69b4; font-style: italic;">open</span><span style="color: #b3b3b3;">*</span> to <span style="color: #b3b3b3;">*</span><span style="color: #ff69b4; font-style: italic;">closed</span><span style="color: #b3b3b3;">*</span>, then click <span style="color: #b3b3b3;">**</span><span style="color: #ff69b4; font-weight: bold;">Apply</span><span style="color: #b3b3b3;">**</span>. All of your closed issues, including the Onboarding issue, will be shown.

Thanks for playing,
Freedom of the Press Foundation
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Garrett Robinson</p>
<p class="date">Created: 2016-03-14 Mon 16:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
